Ran Plan for 3 projects:

1. dir: `atlantis-test` workspace: `default`
1. dir: `azure/dev/eastus/rg1/xdr-content/module` workspace: `default`
1. dir: `azure/dev/eastus/rg1/xdr-content` workspace: `default`

### 1. dir: `atlantis-test` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.test_number will be created
+ resource "local_file" "test_number" {
      + content              = "42"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "output.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d atlantis-test`
* :put_litter_in_its_place: To **delete** this plan click [here](http://5e90393e666c:4141/lock?id=sangharsh-ranpise%252Fcustomer-test-01-infra-live%252Fatlantis-test%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d atlantis-test`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `azure/dev/eastus/rg1/xdr-content/module` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/sangharsh-ranpise/customer-test-01-infra-live/1/default/azure/dev/eastus/rg1/xdr-content/module/default.tfplan\"" in "/home/atlantis/.atlantis/repos/sangharsh-ranpise/customer-test-01-infra-live/1/default/azure/dev/eastus/rg1/xdr-content/module": exit status 1

Error: No value for required variable

  on main.tf line 2:
   2: variable "my_number" {

The root module input variable "my_number" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

```

---
### 3. dir: `azure/dev/eastus/rg1/xdr-content` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/sangharsh-ranpise/customer-test-01-infra-live/1/default/azure/dev/eastus/rg1/xdr-content/default.tfplan\"" in "/home/atlantis/.atlantis/repos/sangharsh-ranpise/customer-test-01-infra-live/1/default/azure/dev/eastus/rg1/xdr-content": exit status 1

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.

```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
